Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-ui/lang/translations/*.po
Languages: be

# Title of the CKEditor5 editor.
source: Rich Text Editor
be: Рэдактар

source: Edit block
be: Рэдагаваць блок

source: Click to edit block
be: Націсніце, каб рэдагаваць блок

source: Drag to move
be: Перацягніце

# Label for a button showing the next thing (tab, page, etc.).
source: Next
be: Наступны

# Label for a button showing the previous thing (tab, page, etc.).
source: Previous
be: Папярэдні

# Label used by assistive technologies describing a generic editor toolbar.
source: Editor toolbar
be: Панэль інструментаў рэдактара

source: Dropdown toolbar
be: Выпадаючая панэль інструментаў

source: Dropdown menu
be: Выпадаючае меню

# Label of a button that applies a black color in color pickers.
source: Black
be: Чорны

# Label of a button that applies a dim grey color in color pickers.
source: Dim grey
be: Цёмны серы

# Label of a button that applies a grey color in color pickers.
source: Grey
be: Серы

# Label of a button that applies a light grey color in color pickers.
source: Light grey
be: Светла-серы

# Label of a button that applies a white color in color pickers.
source: White
be: Белы

# Label of a button that applies a red color in color pickers.
source: Red
be: Чырвоны

# Label of a button that applies a orange color in color pickers.
source: Orange
be: Аранжавы

# Label of a button that applies a yellow color in color pickers.
source: Yellow
be: Жоўты

# Label of a button that applies a light green color in color pickers.
source: Light green
be: Салатавы

# Label of a button that applies a green color in color pickers.
source: Green
be: Зялёны

# Label of a button that applies a aquamarine color in color pickers.
source: Aquamarine
be: Аквамарынавы

# Label of a button that applies a turquoise color in color pickers.
source: Turquoise
be: Бірузовы

# Label of a button that applies a light blue color in color pickers.
source: Light blue
be: Блакітны

# Label of a button that applies a blue color in color pickers.
source: Blue
be: Сіні

# Label of a button that applies a purple color in color pickers.
source: Purple
be: Фіялетавы

source: Editor block content toolbar
be: Панэль інструментаў рэдактара

source: Editor contextual toolbar
be: Кантэкстуальная панэль інструментаў рэдактара

source: No results found
be: Няма вынікаў

# The main text of the message shown to the user when no results are available.
source: No searchable items
be: Няма элементаў для пошуку

# A default label of a dialog window displayed on top the editor.
source: Editor dialog
be: Дыялогавае акно рэдактара

# The label and the tooltip for the close button in the dialog header.
source: Close
be: Закрыць

source: Help Contents. To close this dialog press ESC.
be: Змест дапамогі. Каб закрыць гэта дыялогавае акно, націсніце ESC.

# Accessibility help dialog text explaining what can be found in that dialog.
source: Below, you can find a list of keyboard shortcuts that can be used in the editor.
be: Ніжэй вы можаце знайсці спіс камбінацый клавіш, якія можна выкарыстоўваць у рэдактары.

source: (may require <kbd>Fn</kbd>)
be: (можа патрабаваць <kbd>Fn</kbd>)

source: Accessibility
be: Даступнасць

# Accessibility help dialog title.
source: Accessibility help
be: Дапамога па спецыяльных магчымасцях

source: Press %0 for help.
be: Націсніце %0 для атрымання дапамогі.

source: Move focus in and out of an active dialog window
be: Перамясціць фокус у актыўнае дыялогавае акно і наадварот.

source: MENU_BAR_MENU_FILE
be: Файл

source: MENU_BAR_MENU_EDIT
be: Рэдагаваць

source: MENU_BAR_MENU_VIEW
be: Паглядзець

source: MENU_BAR_MENU_INSERT
be: Уставіць

source: MENU_BAR_MENU_FORMAT
be: Фармат

source: MENU_BAR_MENU_TOOLS
be: Інструменты

source: MENU_BAR_MENU_HELP
be: Дапамога

source: MENU_BAR_MENU_TEXT
be: Тэкст

source: MENU_BAR_MENU_FONT
be: Шрыфт

# The accessible label of the editor menu bar used by assistive technologies.
source: Editor menu bar
be: Панэль меню рэдактара

source: Please enter a valid color (e.g. "ff0000").
be: Увядзіце сапраўдны колер (напрыклад, "ff0000").
