Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-core/lang/translations/*.po
Languages: be, et, fi, lv, ms, no, sv, tr

# Label for the Cancel button.
source: Cancel
be: Адмяніць
et: Loobu
fi: Peruuta
lv: Atcelt
ms: Batal
no: Avbryt
sv: Avbryt
tr: İptal

# Label for the Clear button.
source: Clear
be: Ачысціць
et: Selge
fi: Tyhjennä
lv: Notīrīt
ms: Kosongkan
no: Slett
sv: Rensa
tr: Temizle

source: Remove color
be: Выдаліць колер
et: Eemalda värv
fi: Poista väri
lv: Noņemt krāsu
ms: Buang warna
no: Fjern farge
sv: Ta bort färg
tr: Rengi Sil

source: Restore default
be: Выстаўць па змаўчанні
et: Taasta algne
fi: Palauta oletus
lv: Atgriezt noklusējumu
ms: Pulihkan lalai
no: Tilbakestill til standard
sv: Återställ standard
tr: Varsayılanı geri yükle

# Label for the Save button.
source: Save
be: Захаваць
et: Salvesta
fi: Tallenna
lv: Saglabāt
ms: Simpan
no: Lagre
sv: Spara
tr: Kaydet

# Label of a toolbar button which reveals more toolbar items.
source: Show more items
be: Паказаць больш інструментаў
et: Näita veel
fi: Näytä lisää toimintoja
lv: Parādīt vairāk vienumus
ms: Tunjukkan item lain
no: Vis flere elementer
sv: Visa fler objekt
tr: Daha fazla öğe göster

source: %0 of %1
be: %0 з %1
lv: %0 no %1
ms: %0 daripada %1
no: %0 av %1
sv: %0 av %1

source: Cannot upload file:
be: Немагчыма загрузіць файл:
et: Faili ei suudeta üles laadida:
fi: Tiedostoa ei voitu ladata:
lv: Nevar augšupielādēt failu:
ms: Gagal memuat naik fail
no: Kan ikke laste opp fil:
sv: Kan inte ladda upp fil:
tr: Dosya yüklenemedi:

source: Rich Text Editor. Editing area: %0
be: Рэдактар форматыраванага тэксту. Вобласць рэдагавання: %0
et: Rikastekstiredaktor. Redigeerimisala: %0
fi: Tekstimuotoilueditori. Muokkausalue: %0
lv: Bagātīga Teksta Redaktors. Rediģēšanas zona: %0
ms: Editor Teks Kaya. Ruang suntingan: %0
no: Redigeringsverktøy for rik tekst. Redigeringsområde: %0
sv: RTF-redigerare. Redigeringsområde: %0
tr: Zengin Metin Editörü.Düzenleme alanı: %0

source: Insert with file manager
be: Уставіць з файлавым менеджэрам
et: Sisesta failihalduriga
fi: Tuo tiedostonhallinnalla
lv: Ievietot, izmantojot failu pārvaldnieku
ms: Masukkan dengan pengurus fail
no: Sett inn med filbehandling
sv: Infoga genom filhanteraren
tr: Dosya yöneticisiyle ekle

source: Replace with file manager
be: Замяніць з файлавым менеджэрам
et: Asenda failihalduriga
fi: Korvaa tiedostonhallinnalla
lv: Aizstāt, izmantojot failu pārvaldnieku
ms: Gantikan dengan pengurus fail
no: Erstatt med filbehandling
sv: Ersätt genom filhanteraren
tr: Dosya yöneticisiyle değiştirin

# The label for the insert image with the file manager toolbar button.
source: Insert image with file manager
be: Уставіць выявы з файлавым менеджэрам
et: Sisesta pilt failihalduriga
fi: Tuo kuva tiedostonhallinnalla
lv: Ievietojiet attēlu, izmantojot failu pārvaldnieku
ms: Masukkan imej dengan pengurus fail
no: Sett inn bilde med filbehandling
sv: Infoga bild genom filhanteraren
tr: Dosya yöneticisiyle görüntü ekleyin

# The label for the replace image with the file manager toolbar button.
source: Replace image with file manager
be: Замяніць выявы з файлавым менеджэрам
et: Asenda pilt failihalduriga
fi: Korvaa kuva tiedostonhallinnalla
lv: Aizstāt attēlu, izmantojot failu pārvaldnieku
ms: Gantikan imej dengan pengurus fail
no: Erstatt bilde med filbehandling
sv: Ersätt bild genom filhanteraren
tr: Resmi dosya yöneticisiyle değiştir

# The label for a button that opens a file manager in order to insert a file.
source: File
be: Файл
ms: Fail
sv: Fil

source: With file manager
be: З файлавага менеджэра
ms: Dengan pengurus fail
sv: Med filhanteraren

source: Toggle caption off
be: Выключыць апісанне
et: Lülita pealdis välja
fi: Poista taulukon kuvaus
lv: Izslēgt tabulas parakstu
ms: Tutup kapsyen
no: Veksle tabelltekst av
sv: Slå av rubrik
tr: Açıklamayı kapat

source: Toggle caption on
be: Уключыць апісанне
et: Lülita pealdis sisse
fi: Lisää taulukon kuvaus
lv: Ieslēgt tabulas parakstu
ms: Buka kapsyen
no: Veksle tabelltekst på
sv: Slå på rubrik
tr: Açıklamayı aç

source: Content editing keystrokes
be: Клавішы для рэдагавання кантэнту
et: Sisu muutmise klahvikombinatsioonid
fi: Sisällönmuokkauspainallukset
lv: Satura rediģēšanas taustiņsitieni
ms: Ketukan kekunci penyuntingan kandungan
no: Tastetrykk for innholdsredigering
sv: Tangenter för innehållsredigering
tr: İçerik düzenleme tuş vuruşları

source: These keyboard shortcuts allow for quick access to content editing features.
be: Гэтыя камбінацыі клавіш дазваляюць быстра набіраць функцыі рэдагавання кантэнту.
et: Nende klahvikombinatsioonidega pääseb kiiresti sisu muutmise võimaluste juurde.
fi: Nämä avainoikotiet mahdollistavat sisällönmuokkausominaisuuksien nopean käytön.
lv: Šie īsinājumtaustiņi ļauj ātri piekļūt satura rediģēšanas funkcijām.
ms: Pintasan papan kekunci ini membenarkan akses pantas kepada ciri-ciri penyuntingan kandungan.
no: Disse hurtigtastene gir rask tilgang til funksjonene for innholdsredigering.
sv: Dessa kortkommandon möjliggör snabb innehållsredigering.
tr: Bu klavye kısayolları içerik düzenleme özelliklerine hızlı erişim sağlar.

source: User interface and content navigation keystrokes
be: Клавішы навігацыі па кантэнту і інтэрфейсе карыстальніка
et: Kasutajaliidese ja sisus liikumise klahvikombinatsioonid
fi: Käyttöliittymän ja sisällössä siirtymisen painallukset
lv: Lietotāja interfeisa un satura navigācijas taustiņsitieni
ms: Antara muka pengguna dan ketukan kekunci navigasi kandungan
no: Brukergrensesnitt og tastetrykk for navigering i innhold
sv: Tangenter för användargränssnitt och navigation i innehåll
tr: Kullanıcı arayüzü ve içerik gezinme tuş vuruşları

source: Use the following keystrokes for more efficient navigation in the CKEditor 5 user interface.
be: Выкарыстоўваць наступныя камбінацыі клавіш для больш эфектыўнай навігацыі ў карыстальніцкім інтэрфейсе CKEditor 5.
et: Järgmiste klahvikombinatsioonidega saab tõhusamalt liikuda redaktori CKEditor 5 kasutajaliideses.
fi: Voit tehostaa CKEditor 5:n käyttöliittymässä siirtymistä seuraavilla painalluksilla.
lv: Izmantot tālāk norādītos taustiņsitienus, lai nodrošinātu efektīvāku navigāciju CKEditor 5 lietotāja saskarnē.
ms: Guna ketukan kekunci berikut untuk menavigasi dengan lebih cekap dalam antara muka pengguna CKEditor 5.
no: Bruk følgende tastetrykk for mer effektiv navigering i grensesnittet for 5-brukerversjonen av CKEditor.
sv: Navigera effektivt i CKEditor 5:s användargränssnitt med följande tangenter.
tr: CKEditor 5 kullanıcı arayüzünde daha etkili gezinti için aşağıdaki tuş vuruşlarını kullanın.

source: Close contextual balloons, dropdowns, and dialogs
be: Закрыць контэкставыя всплываючыя вокны, раскрываючыя спісы і дыялогавыя вокны.
et: Sulge konteksti mullid, rippmenüüd ja dialoogid
fi: Sulje kontekstipallot, pudotusvalikot ja dialogit
lv: Aizvērt kontekstuālās joslas, nolaižamās izvēlnes un dialoglodziņus
ms: Tutup belon konteks, senarai juntai bawah dan dialog
no: Lukk hjelpebobler, nedtrekkslister og dialoger
sv: Stäng kontextballonger, rullgardinsmenyer och dialogrutor
tr: Bağlamsal balonları, açılır menüleri ve iletişim kutularını kapat

source: Open the accessibility help dialog
be: Адкрыць дыялогавыя акно дапамогі па спецыяльным магчымасцям
et: Ava juurdepääsu abidialoog
fi: Avaa esteettömyystuen dialogi
lv: Atvērt piekļūstamības palīdzības dialoglodziņu
ms: Buka dialog bantuan kebolehaksesan
no: Åpne dialogen for tilgjengelighetshjelp
sv: Öppna dialogrutan för hjälp med tillgänglighet
tr: Erişilebilirlik yardımı iletişim kutusunu aç

source: Move focus between form fields (inputs, buttons, etc.)
be: Перамясціць фокус паміж палямі формы (уводу, кнопкамі і г. д.)
et: Vaheta ankeedi välju (sisendeid, nuppe jne)
fi: Siirrä tarkennusta eri kaavakekenttien (syötteet, painikkeet yms.) välillä
lv: Pārvietot fokusu starp laukiem (ievades, pogas u.tml.)
ms: Alihkan fokus antara medan borang (input, butang, dll.)
no: Flytt fokus mellom skjemafelt (inputer, knapper osv.)
sv: Flytta fokus mellan formulärfält (inmatningar, knappar m.m.)
tr: Odağı, form alanları (girdiler, düğmeler vb.) arasında taşı

source: Move focus to the menu bar, navigate between menu bars
be: Перамясціць фокус на панэль меню, перамясціцься паміж панелямі меню
fi: Kohdenna valikkopalkkiin ja siirry palkista toiseen
ms: Alihkan fokus ke bar menu, navigasi antara bar menu
no: Flytt fokus til menylinjen, naviger mellom menylinjer
sv: Flytta fokus till menyfältet, navigera mellan menyfält
tr: Odağı menü çubuğuna taşıyın, menü çubukları arasında gezinin

source: Move focus to the toolbar, navigate between toolbars
be: Перамясціць фокус на панэль інструментаў, перамясціцься паміж панэлямі інструментаў
et: Keskendu tööriistaribale, vaheta tööriistaribasid
fi: Siirrä tarkennus työkalupalkkiin, siirry työkalupalkista toiseen
lv: Pārvietot fokusu uz rīkjoslu, pārvietoties starp rīkjoslām
ms: Alihkan fokus ke bar alat, navigasi antara bar alat
no: Flytt fokus til verktøylinjen, naviger mellom verktøylinjer
sv: Flytta fokus till verktygsfältet, navigera mellan verktygsfält
tr: Odağı araç çubuğuna taşı, araç çubukları arasında gezin

source: Navigate through the toolbar or menu bar
be: Навігацыя па панэлі інструментаў або панелі меню
fi: Siirry työkalupalkkien tai valikkopalkkien välillä
ms: Navigasi melalui bar alat atau bar menu
no: Naviger gjennom verktøylinjen eller menylinjen
sv: Navigera genom verktygsfältet eller menyfältet
tr: Araç çubuğu veya menü çubuğunda gezinme

source: Execute the currently focused button. Executing buttons that interact with the editor content moves the focus back to the content.
be: Актываваць кнопку, на якую ўстаўлены фокус. Актывацыя кнопак, якія ўзаемадзейнічаюць з кантэнтам рэдактара, перамяшчае фокус назад на кантэнт.
fi: Suorita tällä hetkellä kohdennettuna olevan painikkeen toiminto. Muokkaustyökalun sisältöön vaikuttavien painikkeiden käyttö palauttaa kohdennuksen kyseiseen sisältöön.
ms: Laksanakan butang yang sedang difokuskan. Melaksanakan butang yang berinteraksi dengan kandungan penyunting mengalihkan fokus kembali ke kandungan.
no: Utløs knappen som nå er i fokus. Utløsing av knapper som påvirker innholdet som redigeres, flytter fokuset tilbake til innholdet.
sv: Kör den knapp som för närvarande är i fokus. När du aktiverar knappar som interagerar med innehållet i redigeraren flyttas fokus tillbaka till innehållet.
tr: O anda odaklanılan düğmeyi çalıştırın. Düzenleyici içeriğiyle etkileşime giren düğmelerin çalıştırılması, odağı içeriğe geri taşır.

# Label of the button confirming the changes done in the current interface.
source: Accept
be: Прыняць
fi: Hyväksy
ms: Terima
no: Godta
sv: Acceptera
tr: Kabul et

# Dropdown option label for the paragraph format.
source: Paragraph
be: Параграф
sv: Paragraf

source: Color picker
be: Выбар колеру
sv: Färgväljare

source: Please try a different phrase or check the spelling.
be: Калі ласка, паспрабуйце іншую фразу або праверце правапіс.

# The label of the source editing related features used in toolbar buttons.
source: Source
be: Крыніца

source: Navigate through the toolbar
et: Liigu tööriistaribas
lv: Pārvietoties rīkjoslā

source: Execute the currently focused button
et: Kasuta praegu aktiivset nuppu
lv: Spiest pašlaik izvēlēto pogu
