Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-bookmark/lang/translations/*.po
Languages: pt

# The label of the bookmark toolbar button. Also, a bookmark form header.
source: Bookmark
pt: Marcador

# Button opening the Bookmark editing balloon.
source: Edit bookmark
pt: Editar marcador

# Toolbar button tooltip for bookmark remove button.
source: Remove bookmark
pt: Remover marcador

source: Bookmark name
pt: Nome do marcador

# The description of bookmark input in the bookmark insert form.
source: Enter the bookmark name without spaces.
pt: Introduza o nome do marcador sem espaços.

# The error message. Displayed when the bookmark name is empty.
source: Bookmark must not be empty.
pt: O marcador não deve estar vazio.

# The error message. Displayed when provided name includes spaces.
source: Bookmark name cannot contain space characters.
pt: O nome do marcador não pode conter caracteres de espaço.

# The error message. Displayed when provided name already exists.
source: Bookmark name already exists.
pt: O nome do marcador já existe.

# The label for the bookmark widget.
source: bookmark widget
pt: widget de marcador

source: Bookmark toolbar
pt: Barra de marcadores

# Title for a feature displaying a list of bookmarks.
source: Bookmarks
pt: Marcadores

# A message displayed instead of a list of bookmarks if it is empty.
source: No bookmarks available.
pt: Sem marcadores disponíveis.

# Tooltip shown after hovering the bookmark link preview.
source: Scroll to bookmark
pt: Ir para o marcador
