Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-list/lang/translations/*.po
Languages: be

# Toolbar button tooltip for the Numbered List feature.
source: Numbered List
be: Нумарыроўваны спіс

# Toolbar button tooltip for the Bulleted List feature.
source: Bulleted List
be: Маркіраваны спіс

# Toolbar button tooltip for the To-do List feature.
source: To-do List
be: Спіс задач

source: Bulleted list styles toolbar
be: Стылі маркіраваных спісаў

source: Numbered list styles toolbar
be: Стылі нумарыроўваных спісаў

# The ARIA label of the button that toggles the "disc" list style.
source: Toggle the disc list style
be: Пераключыць на стыль маркіраваных спісаў з дыскам

# The ARIA label of the button that toggles the "circle" list style.
source: Toggle the circle list style
be: Пераключыць на стыль маркіраваных спісаў з кругам

# The ARIA label of the button that toggles the "square" list style.
source: Toggle the square list style
be: Пераключыць на стыль маркіраваных спісаў з квадратам

# The ARIA label of the button that toggles the "decimal" list style.
source: Toggle the decimal list style
be: Пераключыць на стыль маркіраваных спісаў з лікамі

source: Toggle the decimal with leading zero list style
be: Пераключыць стыль спісу з дзесятковым лікам, які пачынаецца з нуля

# The ARIA label of the button that toggles the "lower–roman" list style.
source: Toggle the lower–roman list style
be: Пераключыць на стыль маркіраваных спісаў з малымі рымскімі лікамі

# The ARIA label of the button that toggles the "upper–roman" list style.
source: Toggle the upper–roman list style
be: Пераключыць на стыль маркіраваных спісаў з вялікімі рымскімі лікамі

# The ARIA label of the button that toggles the "lower–latin" list style.
source: Toggle the lower–latin list style
be: Пераключыць на стыль маркіраваных спісаў з малымі лацінскімі лікамі

# The ARIA label of the button that toggles the "upper–latin" list style.
source: Toggle the upper–latin list style
be: Пераключыць на стыль маркіраваных спісаў з вялікімі лацінскімі лікамі

# The tooltip text of the button that toggles the "disc" list style.
source: Disc
be: Дыск

# The tooltip text of the button that toggles the "circle" list style.
source: Circle
be: Круг

# The tooltip text of the button that toggles the "square" list style.
source: Square
be: Квадрат

# The tooltip text of the button that toggles the "decimal" list style.
source: Decimal
be: Дзесятковы

source: Decimal with leading zero
be: Дзесятковы з нулямі ў пачатку

# The tooltip text of the button that toggles the "lower–roman" list style.
source: Lower–roman
be: Малыя рымскія

# The tooltip text of the button that toggles the "upper–roman" list style.
source: Upper-roman
be: Вялікія рымскія

# The tooltip text of the button that toggles the "lower–latin" list style.
source: Lower-latin
be: Малыя лацінскія

# The tooltip text of the button that toggles the "upper–latin" list style.
source: Upper-latin
be: Вялікія лацінскія

source: List properties
be: Уласцівасці спіса

# The label of the input allowing to change the start index of a numbered list.
source: Start at
be: Пачаць з

source: Invalid start index value.
be: Памылковае значэнне пачатковага індэкса.

source: Start index must be greater than 0.
be: Пачатковы індэкс павінен быць большым за 0.

# The label of the switch button that reverses the order of the numbered list.
source: Reversed order
be: Адваротны парадак

source: Keystrokes that can be used in a list
be: Спалучэнні клавіш, якія можна выкарыстоўваць у спісе

source: Increase list item indent
be: Павялічыць адступ элемента спісу

source: Decrease list item indent
be: Паменшыць адступ элемента спісу

# Assistive technologies label for entering the to-do list.
source: Entering a to-do list
be: Увод спісу задач

# Assistive technologies label for leaving the to-do list.
source: Leaving a to-do list
be: Выхад з спісу задач
