Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-widget/lang/translations/*.po
Languages: be

source: Widget toolbar
be: Панель інструментаў віджэта

source: Insert paragraph before block
be: Уставіць параграф перад блокам

source: Insert paragraph after block
be: Уставіць параграф пасля блока

# Information to be read by screen reader about shortcuts to type around a widget.
source: Press Enter to type after or press Shift + Enter to type before the widget
be: Націсніце Enter для ўводу тэксту пасля віджэта або націсніце Shift + Enter для ўводу тэксту перад віджэтам

# Accessibility help dialog section title for widget plugin keystrokes.
source: Keystrokes that can be used when a widget is selected (for example: image, table, etc.)
be: Націскі клавіш, якія можна выкарыстоўваць пры выбару віджэта (напрыклад: відарыс, табліца і г. д.)

source: Insert a new paragraph directly after a widget
be: Уставіць новы абзац пасля віджэта.

source: Insert a new paragraph directly before a widget
be: Уставіць новы абзац напярэдзе віджэта.

source: Move the caret to allow typing directly before a widget
be: Перамясціце курсор, каб можна было ўводзіць тэкст напярэдзе віджэта.

source: Move the caret to allow typing directly after a widget
be: Перамясціце курсор, каб можна было ўводзіць тэкст пасля віджэта.

source: Move focus from an editable area back to the parent widget
be: Перамясціце фокус з рэдагававальнай вобласці назад на бацькоўскі віджэт
