Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-link/lang/translations/*.po
Languages: be

# Toolbar button tooltip for the Unlink feature.
source: Unlink
be: Выдаліць спасылку

# Toolbar button tooltip for the Link feature.
source: Link
be: Спасылка

# Label for the URL input in the Link URL editing balloon.
source: Link URL
be: Спасылка URL

# An error text displayed when user attempted to enter an empty URL.
source: Link URL must not be empty.
be: URL-адрас спасылкі не павінен быць пустым.

# Label for the image link button.
source: Link image
be: Спасылка на відарыс

# Button opening the Link URL editing balloon.
source: Edit link
be: Рэдагаваць спасылку

# Button opening the link in new browser tab.
source: Open link in new tab
be: Адкрыць спасылку ў новай укладцы

source: Open in a new tab
be: Адкрыць ў новай укладцы

source: Downloadable
be: Даступны для спампоўкі

# Keystroke description for assistive technologies: keystroke for creating a link.
source: Create link
be: Стварыць спасылку

source: Move out of a link
be: Выйсці з спасылкі
