Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-emoji/lang/translations/*.po
Languages: ar, be, bg, bn, ca, cs, da, el, es, fi, he, hi, hu, it, ja, lv, ms, nl, no, pt, ro, ru, sk, sv, th, vi

# Toolbar button tooltip for the Emoji feature.
source: Emoji
ar: الرموز التعبيرية
be: Эмодзі
bg: Емотикон
bn: ইমোজি
cs: Emotikon
hi: इमोजी
ja: 絵文字
lv: Emocijzīme
ru: Эмодзи
sk: Emotikon
th: อิโมจิ
vi: Biểu tượng cảm xúc

source: Show all emoji...
ar: إظهار جميع الرموز التعبيرية...
be: Паказаць усе эмодзі...
bg: Покажи всички емотикони...
bn: সমস্ত ইমোজি দেখান...
ca: Mostra tots els emojis...
cs: Zobrazit všechny emotikony…
da: Vis alle emojis...
el: Εμφάνιση όλων των emoji...
es: Mostrar todos los emojis...
fi: Näytä kaikki emojit...
he: צ ת ס '...
hi: सभी इमोजी दिखाएँ...
hu: Minden emoji megjelenítése...
it: Mostra tutti gli emoji...
ja: すべての絵文字を表示...
lv: Rādīt visas emocijzīmes...
ms: Tunjukkan semua emoji...
nl: Toon alle emoji...
no: Vis alle emojiene...
pt: Mostrar todos os emojis...
ro: Arată toate emoji...
ru: Показать все эмодзи...
sk: Zobraziť všetky emotikony...
sv: Visa alla emojis ...
th: แสดงอิโมจิทั้งหมด...
vi: Hiển thị tất cả biểu tượng cảm xúc...

# Label of an input field for filtering an emoji collection by the typed value.
source: Find an emoji (min. 2 characters)
ar: ابحث عن رمز تعبيري (حد أدنى حرفين)
be: Знайсці эмодзі (мін. 2 сімвала)
bg: Намери емотикон (мин. 2 знака)
bn: একটি ইমোজির সন্ধান করুন (কমপক্ষে 2 টি ক্যারেক্টার)
ca: Troba un emoji (mín. 2 caràcters)
cs: Najít emotikon (min. 2 znaky)
da: Find en emoji (mindst 2 tegn)
el: Βρείτε ένα emoji (τουλάχιστον 2 χαρακτήρες)
es: Busca un emoji (2 caracteres como mínimo)
fi: Etsi emoji (väh. 2 merkkiä)
he: פש ' ( 2 ת)
hi: एक इमोजी ढूंढें (कम से कम 2 अक्षर)
hu: Emoji keresése (min. 2 karakter)
it: Trova un emoji (min. 2 caratteri)
ja: 絵文字を検索（2文字以上）
lv: Atrast emocijzīmi (vismaz 2 rakstu zīmes)
ms: Cari emoji (min. 2 aksara)
nl: Vind een emoji (min. 2 tekens)
no: Finn en emoji (min. 2 tegn)
pt: Encontrar um emoji (mín. 2 carateres)
ro: Găsește un emoji (min. 2 caractere)
ru: Найти эмодзи (мин. 2 символа)
sk: Nájsť emotikon (min. 2 znaky)
sv: Hitta en emoji (minst 2 tecken)
th: ค้นหาอิโมจิ (อักขระอย่างน้อย 2 ตัว)
vi: Tìm biểu tượng cảm xúc (tối thiểu 2 ký tự)

source: No emojis were found matching "%0".
ar: لم نعثر على أي رموز تعبيرية مطابقة لـ "%0".
be: Не знойдзены эмодзі, якія адпавядаюць "%0".
bg: Не бяха намерени емотикони, съответстващи на „%0“.
bn: "%0" এর সাথে মেলে এমন কোনো ইমোজি পাওয়া যায়নি।
ca: No s'ha trobat cap emoji que coincideixi amb "%0".
cs: Nebyly nalezeny žádné emotikony odpovídající „%0“.
da: Ingen emojis fundet, der matcher "%0".
el: Δεν βρέθηκαν emoji που να ταιριάζουν με το "%0".
es: No se han encontrado emojis que coincidan con «%0».
fi: "%0" -hakuehtoa vastaavia emojeja ei löytynyt.
he: צ ס ' ת -"%0".
hi: "%0" से मेल खाता कोई इमोजी नहीं मिला.
hu: Nem található emoji „%0” kifejezésre.
it: Non sono state trovati emoji corrispondenti a "%0".
ja: 「%0」に一致する絵文字は見つかりませんでした。
lv: Netika atrasta neviena emocijzīme, kas atbilstu "%0".
ms: Tiada emoji ditemui yang sepadan dengan "%0".
nl: Er zijn geen emoji gevonden overeenkomend met "%0".
no: Ingen emojier ble funnet som samsvarer med «%0».
pt: Não foi encontrado nenhum emoji que corresponda a "%0".
ro: Nu s-a găsit niciun emoji pentru "%0".
ru: Не найдено ни одного эмодзи, соответствующего "%0".
sk: Nenašli sa žiadne emotikony zodpovedajúce výrazu „%0“.
sv: Inga emojis motsvarande "%0" fanns.
th: ไม่พบอิโมจิที่ตรงกับ "%0"
vi: Không tìm thấy biểu tượng cảm xúc nào khớp với "%0".

source: Keep on typing to see the emoji.
ar: استمر في الكتابة لرؤية الرمز التعبيري.
be: Працягвайце набіраць тэкст, каб убачыць эмодзі.
bg: Продължи да пишеш, за да видиш емотикона.
bn: ইমোজিটি দেখতে টাইপ করতে থাকুন।
ca: Continua escrivint per veure l'emoji.
cs: Pokud chcete zobrazit emotikon, pokračujte v psaní.
da: Bliv ved med at skrive for at se emojien.
el: Συνεχίστε να πληκτρολογείτε για να δείτε το emoji.
es: Sigue escribiendo para ver el emoji.
fi: Tuo emoji näkyviin jatkamalla kirjoittamista.
he: ש ק רת ת '.
hi: इमोजी देखने के लिए टाइप करते रहें.
hu: Írjon tovább az emoji megjelenéséhez.
it: Continua a digitare per vedere l'emoji.
ja: 絵文字を表示するには入力を続けてください。
lv: Turpini rakstīt, lai ieraudzītu emocijzīmi.
ms: Teruskan menaip untuk melihat emoji.
nl: Blijf typen om de emoji te zien.
no: Fortsett å skrive for å se emojien.
pt: Continue a escrever para ver o emoji.
ro: Mai încearcă să vezi emoji.
ru: Продолжайте набирать текст, чтобы увидеть эмодзи.
sk: Pokračujte v písaní, aby ste videli emotikony.
sv: Fortsätt att skriva för att se emojin.
th: พิมพ์ต่อไปเพื่อดูอิโมจิ
vi: Tiếp tục nhập để xem biểu tượng cảm xúc.

source: The query must contain at least two characters.
ar: يجب أن يحتوي الاستعلام على حرفين على الأقل.
be: Запыт павінен утрымліваць не менш двух сімвалаў.
bg: Заявката трябва да съдържа поне два знака.
bn: কোয়েরিটিতে কমপক্ষে দুটি ক্যারেক্টার থাকতে হবে।
ca: La consulta ha de contenir com a mínim dos caràcters.
cs: Dotaz musí obsahovat alespoň dva znaky.
da: Forespørgslen skal indeholde mindst to tegn.
el: Το ερώτημα πρέπει να περιέχει τουλάχιστον δύο χαρακτήρες.
es: La solicitud debe contener al menos dos caracteres.
fi: Haussa on oltava vähintään 2 merkkiä.
he: שת ת פת ש ת.
hi: क्वेरी में कम से कम दो अक्षर होने चाहिए.
hu: A kérés legalább 2 karaktert kell tartalmazzon.
it: La ricerca deve contenere almeno due caratteri.
ja: 検索語句は2文字以上入力してください。
lv: Pieprasījumā ir jābūt vismaz 2 rakstu zīmēm.
ms: Pertanyaan mesti mengandungi sekurang-kurangnya dua aksara.
nl: De zoekopdracht moet ten minste 2 tekens bevatten.
no: Spørringen må inneholde minst to tegn.
pt: A consulta deve conter, pelo menos, dois carateres.
ro: Interogarea trebuie să conțină cel puțin două caractere.
ru: Запрос должен содержать не менее двух символов.
sk: Dotaz musí obsahovať aspoň dva znaky.
sv: Frågan måste innehålla minst två tecken.
th: คำค้นหาต้องมีอักขระอย่างน้อยสองตัว
vi: Truy vấn phải chứa ít nhất hai ký tự.

source: Smileys & Expressions
ar: الابتسامات والتعبيرات
be: Смайлы і эмоцыі
bg: Усмивки и емоции
bn: স্মাইলি ও অভিব্যক্তি
ca: Emoticones i expressions
cs: Smajlíci a výrazy
da: Smileys og udtryk
el: Χαμογελάκια και Εκφράσεις
es: Emoticonos y expresiones
fi: Hymiöt & ilmeet
he: ס עת
hi: स्माइलीज़ और एक्सप्रेशंस
hu: Smiley-k és arckifejezések
it: Faccine ed espressioni
ja: スマイリーと表情
lv: Smaidiņi & Emocijas
ms: Wajah tersenyum & Ekspresi
nl: Smileys & gezichtsuitdrukkingen
no: Smileys og uttrykk
pt: Smiley e expressões
ro: Smiley și expresii
ru: Смайлы и эмоции
sk: Smajlíky a výrazy
sv: Smileys och uttryck
th: รอยยิ้มและสีหน้า
vi: Biểu tượng cảm xúc & Biểu cảm

# Tooltip for filtering the displayed emoji by the "Gestures & People" category.
source: Gestures & People
ar: الإيماءات والأشخاص
be: Жэсты і людзі
bg: Мимики и хора
bn: অঙ্গভঙ্গি ও মানুষ
ca: Gestos i gent
cs: Gesta a lidé
da: Fagter og personer
el: Χειρονομίες και Άνθρωποι
es: Gestos y personas
fi: Eleet & ihmiset
he: ת ש
hi: इशारे और लोग
hu: Gesztusok és emberek
it: Gesti e persone
ja: ジェスチャーと人物
lv: Žesti & Cilvēki
ms: Gerak isyarat & Orang
nl: Gebaren & mensen
no: Gester og mennesker
pt: Gestos e pessoas
ro: Gesturi și oameni
ru: Жесты и люди
sk: Gestá a ľudia
sv: Gester och personer
th: ท่าทางและผู้คน
vi: Cử chỉ & Con người

# Tooltip for filtering the displayed emoji by the "Animals & Nature" category.
source: Animals & Nature
ar: الحيوانات والطبيعة
be: Жывёлы і прырода
bg: Животни и природа
bn: প্রাণী ও প্রকৃতি
ca: Animals i naturalesa
cs: Zvířata a příroda
da: Dyr og natur
el: Ζώα και Φύση
es: Animales y naturaleza
fi: Eläimet & luonto
he: ע ע
hi: पशु और प्रकृति
hu: Állatok és természet
it: Animali e natura
ja: 動物と自然
lv: Dzīvnieki & Daba
ms: Haiwan & Alam Semula Jadi
nl: Dieren & natuur
no: Dyr og natur
pt: Animais e natureza
ro: Animale și natură
ru: Животные и природа
sk: Zvieratá a príroda
sv: Djur och natur
th: สัตว์และธรรมชาติ
vi: Động vật & Thiên nhiên

# Tooltip for filtering the displayed emoji by the "Food & Drinks" category.
source: Food & Drinks
ar: الأطعمة والمشروبات
be: Ежа і напіткі
bg: Храна и напитки
bn: খাদ্য ও পানীয়
ca: Menjar i beguda
cs: Jídlo a pití
da: Mad og drikke
el: Φαγητό και Ποτά
es: Comidas y bebidas
fi: Ruoka & juoma
he: שקת
hi: फ़ूड और ड्रिंक्स
hu: Étel és ital
it: Cibo e bevande
ja: 食べ物と飲み物
lv: Ēdieni & Dzērieni
ms: Makanan & Minuman
nl: Eten & drinken
no: Mat og drikke
pt: Comida e bebidas
ro: Mâncare și băuturi
ru: Еда и напитки
sk: Jedlá a nápoje
sv: Mat och dryck
th: อาหารและเครื่องดื่ม
vi: Đồ ăn & Thức uống

# Tooltip for filtering the displayed emoji by the "Travel & Places" category.
source: Travel & Places
ar: السفر والأماكن
be: Падарожжа і месцы
bg: Пътуване и места
bn: ভ্রমণ ও স্থান
ca: Viatges i llocs
cs: Cestování a místa
da: Rejse og steder
el: Ταξίδια και Μέρη
es: Viajes y lugares
fi: Matkustus & paikat
he: סעת קת
hi: ट्रैवल और स्थान
hu: Utazás és helyek
it: Viaggi e luoghi
ja: 旅行と場所
lv: Ceļojumi & Vietas
ms: Perjalanan & Tempat
nl: Reizen & plaatsen
no: Reise og steder
pt: Viagens e lugares
ro: Călătorii și locuri
ru: Путешествия и достопримечательности
sk: Cestovanie a miesta
sv: Resor och platser
th: การเดินทางและสถานที่
vi: Du lịch & Địa điểm

# Tooltip for filtering the displayed emoji by the "Activities" category.
source: Activities
ar: الأنشطة
be: Актыўнасці
bg: Дейности
bn: কার্যক্রম
ca: Activitats
cs: Aktivity
da: Aktiviteter
el: Δραστηριότητες
es: Actividades
fi: Aktiviteetit
he: פעת
hi: गतिविधियाँ
hu: Tevékenységek
it: Attività
ja: アクティビティ
lv: Darbības
ms: Aktiviti
nl: Activiteiten
no: Aktiviteter
pt: Atividades
ro: Activități
ru: Развлечения
sk: Aktivity
sv: Aktiviteter
th: กิจกรรม
vi: Hoạt động

# Tooltip for filtering the displayed emoji by the "Objects" category.
source: Objects
ar: الأشياء
be: Аб'екты
bg: Предмети
bn: বস্তু
ca: Objectes
cs: Objekty
da: Objekter
el: Αντικείμενα
es: Objetos
fi: Esineet
he: פצ
hi: वस्तुओं
hu: Tárgyak
it: Oggetti
ja: 物
lv: Objekti
ms: Objek
nl: Objecten
no: Gjenstander
pt: Objetos
ro: Obiecte
ru: Объекты
sk: Objekty
sv: Objekt
th: วัตถุ
vi: Vật thể

# Tooltip for filtering the displayed emoji by the "Symbols" category.
source: Symbols
ar: الرموز
be: Сімвалы
bg: Символи
bn: প্রতীক
ca: Símbols
cs: Symboly
da: Symboler
el: Σύμβολα
es: Símbolos
fi: Symbolit
he: ס
hi: सिंबल
hu: Jelek
it: Simboli
ja: 記号
lv: Simboli
ms: Simbol
nl: Symbolen
no: Symboler
pt: Símbolos
ro: Sim
ru: Символы
sk: Symboly
sv: Symboler
th: สัญลักษณ์
vi: Biểu tượng

# Tooltip for filtering the displayed emoji by the "Flags" category.
source: Flags
ar: الأعلام
be: Флагі
bg: Знамена
bn: পতাকা
ca: Banderes
cs: Vlajky
da: Flag
el: Σημαίες
es: Banderas
fi: Liput
hi: झंडे
hu: Zászlók
it: Bandiere
ja: 国旗
lv: Karogi
ms: Bendera
nl: Vlaggen
no: Flagg
pt: Bandeiras
ro: Steaguri
ru: Флаги
sk: Zástavy
sv: Flaggor
th: ธง
vi: Cờ

# Default label for the emoji skin tone dropdown.
source: Select skin tone
ar: حدد لون البشرة
be: Выберыце тон скуры
bg: Избери цвят на кожата
bn: স্কিন টোন নির্বাচন করুন
ca: Selecciona el to de pell
cs: Vyberte tón pleti
da: Vælg hudfarve
el: Επιλέξτε τόνο επιδερμίδας
es: Seleccionar tono de piel
fi: Valitse ihonväri
he: ר ער
hi: स्किन टोन चुनें
hu: Válasszon bőrszínt
it: Seleziona la tonalità della pelle
ja: 肌の色を選択
lv: Izvēlies ietvara toni
ms: Pilih tona kulit
nl: Selecteer huidskleur
no: Velg hudfarge
pt: Selecionar tom de pele
ro: Selectează tonul pielii
ru: Выберите цвет кожи
sk: Vyberte tón pleti
sv: Välj hudton
th: เลือกโทนสีผิว
vi: Chọn tông màu da

source: Default skin tone
ar: لون البشرة الافتراضي
be: Прадвызначаны тон скуры
bg: Цвят на кожата по подразбиране
bn: ডিফল্ট স্কিন টোন
ca: To de pell predeterminat
cs: Výchozí tón pleti
da: Standardhudfarve
el: Προεπιλεγμένος τόνος επιδερμίδας
es: Tono de piel predeterminado
fi: Oletusarvoinen ihonväri
hi: डिफ़ॉल्ट स्किन टोन
hu: Alapértelmezett bőrszín
it: Tonalità di pelle predefinita
ja: デフォルトの肌の色
lv: Noklusējuma ietvara tonis
ms: Tona kulit lalai
nl: Standaard huidskleur
no: Standard hudfarge
pt: Tom de pele padrão
ro: Ton de piele implicit
ru: Цвет кожи по умолчанию
sk: Predvolený tón pleti
sv: Standardhudton
th: สีผิวเริ่มต้น
vi: Tông màu da mặc định

source: Light skin tone
ar: لون البشرة الفاتح
be: Светлы тон скуры
bg: Светъл цвят на кожата
bn: হালকা স্কিন টোন
ca: To de pell clar
cs: Světlý tón pleti
da: Lys hudfarve
el: Ανοιχτός τόνος επιδερμίδας
es: Tono de piel claro
fi: Vaalea ihonväri
hi: हल्की स्किन टोन
hu: Világos bőrszín
it: Tonalità di pelle chiara
ja: 明るい肌の色
lv: Gaišs ietvara tonis
ms: Tona kulit cerah
nl: Lichte huidskleur
no: Lys hudfarge
pt: Tom de pele claro
ro: Ton de piele deschis
ru: Светлый оттенок кожи
sk: Svetlý tón pleti
sv: Ljus hudton
th: สีผิวอ่อน
vi: Tông màu da sáng

source: Medium Light skin tone
ar: لون بشرة فاتح متوسط
be: Сярэдні светлы тон скуры
bg: Средно светъл цвят на кожата
bn: মাঝারি হালকা স্কিন টোন
ca: To de pell mitjà-clar
cs: Středně světlý tón pleti
da: Mellemlys hudfarve
el: Μεσαίος προς ανοιχτό τόνος επιδερμίδας
es: Tono de piel medio claro
fi: Keskivaalea ihonväri
hi: मध्यम हल्की स्किन टोन
hu: Közepesen világos bőrszín
it: Tonalità di pelle medio-chiara
ja: やや明るい肌の色
lv: Vidēji Gaišs ietvara tonis
ms: Tona kulit Sederhana Cerah
nl: Redelijk lichte huidskleur
no: Medium lys hudfarge
pt: Tom de pele médio claro
ro: Ton de piele mediu-deschis
ru: Средне-светлый оттенок кожи
sk: Stredne svetlý tón pleti
sv: Medelljus hudton
th: สีผิวอ่อนปานกลาง
vi: Tông màu da sáng trung bình

source: Medium skin tone
ar: لون البشرة متوسط
be: Сярэдні тон скуры
bg: Среден цвят на кожата
bn: মাঝারি স্কিন টোন
ca: To de pell mitjà
cs: Střední tón pleti
da: Mellem hudfarve
el: Μεσαίος τόνος επιδερμίδας
es: Tono de piel medio
fi: Keskivälin ihonväri
hi: मध्यम स्किन टोन
hu: Közepes bőrszín
it: Tonalità di pelle media
ja: 中間の肌の色
lv: Vidējs ietvara tonis
ms: Tona kulit sederhana
nl: Gemiddeld getinte huidskleur
no: Medium hudfarge
pt: Tom de pele médio
ro: Ton de piele mediu
ru: Средний оттенок кожи
sk: Stredný tón pleti
sv: Mediumhudton
th: สีผิวปานกลาง
vi: Tông màu da trung bình

source: Medium Dark skin tone
ar: لون البشرة ​​داكن متوسط
be: Сярэдні цёмны тон скуры
bg: Средно тъмен цвят на кожата
bn: মাঝারি গাঢ় স্কিন টোন
ca: To de pell mitjà-fosc
cs: Středně tmavý tón pleti
da: Mellemmørk hudfarve
el: Μεσαίος προς σκούρο τόνος επιδερμίδας
es: Tono de piel medio oscuro
fi: Keskitumma ihonväri
hi: मध्यम गहरे स्किन टोन
hu: Közepesen sötét bőrszín
it: Tonalità di pelle medio-scura
ja: やや暗い肌の色
lv: Vidēji Tumšs ietvara tonis
ms: Tona kulit Sederhana Gelap
nl: Redelijk donkere huidskleur
no: Middels mørk hudfarge
pt: Tom de pele médio escuro
ro: Ton de piele mediu-închis
ru: Средне-темный оттенок кожи
sk: Stredne tmavý tón pleti
sv: Medelmörk hudton
th: สีผิวเข้มปานกลาง
vi: Tông màu da tối trung bình

# Dropdown option label for using the "Dark skin tone" variant. Example emoji: 👋🏿.
source: Dark skin tone
ar: لون بشرة داكن
be: Цёмны тон скуры
bg: Тъмен цвят на кожата
bn: গাঢ় স্কিন টোন
ca: To de pell fosc
cs: Tmavý tón pleti
da: Mørk hudfarve
el: Σκούρος τόνος επιδερμίδας
es: Tono de piel oscuro
fi: Tumma ihonväri
hi: गहरे रंग का स्किन टोन
hu: Sötét bőrszín
it: Tonalità di pelle scura
ja: 暗い肌の色
lv: Tumšs ietvara tonis
ms: Tona kulit gelap
nl: Donkere huidskleur
no: Mørk hudfarge
pt: Tom de pele escuro
ro: Ton de piele închis
ru: Темный оттенок кожи
sk: Tmavý tón pleti
sv: Mörk hudton
th: สีผิวเข้ม
vi: Tông màu da tối

# Header of the emoji picker balloon panel.
source: Emoji picker
bg: Избор на емотикони
bn: ইমোজি পিকার
ca: Selector d'emojis
da: Emoji-vælger
es: Selector de emojis
fi: Emojien valitsin
he: רר '
hi: इमोजी पिकर
hu: Emojiválasztó
it: Selettore di emoji
pt: Seletor de emojis
ru: Выбор эмодзи
th: ตัวเลือกอีโมจิ
vi: Bảng chọn biểu tượng cảm xúc

source: Default skin tone
he: ער ררת

# Dropdown option label for using the "Light skin tone" variant. Example emoji: .
source: Light skin tone
he: ער ר

source: Medium Light skin tone
he: ער ר

# Dropdown option label for using the "Medium skin tone" variant. Example emoji: .
source: Medium skin tone
he: ער

source: Medium Dark skin tone
he: ער

# Dropdown option label for using the "Dark skin tone" variant. Example emoji: .
source: Dark skin tone
he: ער
