Repository: ckeditor/ckeditor5
Catalog: packages/ckeditor5-media-embed/lang/translations/*.po
Languages: ar, pl

# Label for the media widget.
source: media widget
ar: أداة الوسائط
pl: widget osadzenia mediów

# Label for the URL input in the Media Embed URL editing balloon.
source: Media URL
ar: عنوان URL الوسائط
pl: Adres URL

source: Paste the media URL in the input.
ar: ألصق عنوان URL الوسائط في موضع الإدخال.
pl: Wklej adres URL mediów do pola.

source: Tip: Paste the URL into the content to embed faster.
ar: نصيحة: ألصق عنوان URL داخل المحتوى؛ لتسريع عملية التضمين.
pl: Wskazówka: Wklej URL do treści edytora, by łatwiej osadzić media.

# An error message that informs about an empty value in the URL input.
source: The URL must not be empty.
ar: لا يمكن ترك بيان عنوان URL فارغاً.
pl: Adres URL nie może być pusty.

# An error message that informs about unsupported media URL.
source: This media URL is not supported.
ar: عنوان URL الوسائط هذا غير مدعوم.
pl: Ten rodzaj adresu URL nie jest obsługiwany.

# Toolbar button tooltip for the Media Embed feature.
source: Insert media
ar: أدخل الوسائط
pl: Wstaw media

# Label describing type of the inserted content (e.g. 'insert media').
source: Media
ar: وسائط
pl: Nośniki

source: Media toolbar
ar: شريط أدوات الوسائط
pl: Pasek narzędzi mediów

source: Open media in new tab
ar: فتح الوسائط في علامة تبويب جديدة
pl: Otwórz media w nowej zakładce

# The label for the Media Embed balloon.
source: Media embed
ar: تضمين الوسائط
pl: Osadzanie multimediów
